import React, { useEffect } from 'react';
import { useDispatch } from 'react-redux';
import { setLoading } from '../redux/actions/layoutActions';
import logo from '../public/assets/logo/ramble.png';

const useragreement = () => {
  const dispatch = useDispatch();
  useEffect(() => {
    dispatch(setLoading(false));
  }, []);
  return (
    <div style={{ maxWidth: 600, margin: 'auto', padding: '20px 20px 100px' }}>
      <div style={{ display: 'flex', justifyContent: 'center' }}>
        <img src={logo} style={{ width: 'auto', height: 100 }} />
      </div>
      <h1>ข้อตกลงและเงื่อนไขการใช้งาน</h1>
      <p>
        นิยาม: <span style={{ fontWeight: 'bold' }}>“แอปพลิเคชัน”</span> หมายถึง
        แอปพลิเคชัน Ramble และ/หรือแอปพลิเคชันอื่นใดซึ่งนาซ่าซิตี้
        เป็นผู้ให้บริการ และ/หรือแอปพลิเคชันชื่ออื่นที่ นาซ่า ซิตี้
        เป็นผู้พัฒนาหรือปรับแต่ง (Customize) (ทั้งเวอร์ชันสำหรับคอมพิวเตอร์ (PC
        Version) และเวอร์ชันที่ให้บริการในโทรศัพท์มือถือ
        ตลอดจนอุปกรณ์อิเล็กทรอนิกส์อื่น ๆ (Mobile Version)
      </p>
      <p>
        <span style={{ fontWeight: 'bold' }}>“บริการของ นาซ่าซิตี้”</span>{' '}
        หมายถึง แอปพลิเคชัน Ramble และเว็บไซต์ที่ได้ฝากเว็บไซต์ไว้ที่ระบบของ
        Ramble (Web Hosting) ซึ่งที่อยู่ของเว็บไซต์ (Web Address)
        ดังกล่าวอาจปรากฏ “ramble-club.com” เป็นส่วนหนึ่งของ URL หรือไม่ก็ได้
      </p>
      <p>
        <span style={{ fontWeight: 'bold' }}>“นาซ่า ซิตี้”</span> หมายถึง
        บริษัทนาซ่าซิตี้ จำกัด
      </p>
      <p>
        <span style={{ fontWeight: 'bold' }}>“ผู้ใช้งาน”</span> หมายถึง
        ผู้ใช้บริการแอปพลิเคชัน และ/หรือบริการของ นาซ่าซิตี้
      </p>
      <p>
        <span style={{ fontWeight: 'bold' }}>
          “ข้อตกลงและเงื่อนไขการใช้งาน”
        </span>{' '}
        หมายถึง ข้อตกลงและเงื่อนไขในการใช้งานแอปพลิเคชันและบริการของ นาซ่าซิตี้
        ซึ่งหมายความรวมถึงแต่ไม่จำกัดเฉพาะ
        แอปพลิเคชันที่ให้บริการในโทรศัพท์มือถือ แท็บเล็ต (Tablet)
        หรืออุปกรณ์อิเล็กทรอนิกส์อื่น ๆ
        และให้ใช้บังคับรวมถึงแอปพลิเคชันและบริการของ นาซ่าซิตี้
        ในส่วนที่ได้มีการเปลี่ยนแปลง ปรับปรุง อัพเดต หรือเพิ่มเติมโดยนาซ่า ซิตี้
        ทั้งนี้ เว้นแต่แอปพลิเคชันหรือบริการของนาซ่าซิตี้
        ดังกล่าวที่ได้มีการเปลี่ยนแปลง ปรับปรุง อัพเดต
        หรือเพิ่มเติมนั้นจะถูกกำหนดไว้โดยเฉพาะว่าให้อยู่ภายใต้ข้อตกลงและเงื่อนไขการใช้งานที่แตกต่างจากข้อตกลงและเงื่อนไขการใช้งานนี้
      </p>
      <p>
        <span style={{ fontWeight: 'bold' }}>“ผู้ใช้งาน”</span> หมายถึง
        ผู้ใช้บริการแอปพลิเคชัน และ/หรือบริการของ นาซ่าซิตี้
      </p>
      <h2>1. ข้อตกลงทั่วไป</h2>
      <p>
        1.1 ผู้ใช้งานรับทราบและตกลงว่าข้อตกลงและเงื่อนไขการใช้งานนี้
        มีขึ้นเพื่อบังคับใช้กับการใช้บริการของนาซ่าซิตี้
        รวมถึงการใช้สินค้าและบริการ การเข้าถึงและใช้เนื้อหา ฟีเจอร์ เทคโนโลยี
        หรือฟังก์ชันต่าง ๆ ในบริการของนาซ่าซิตี้ ตลอดจนแอปพลิเคชัน
        และบริการที่เกี่ยวข้องกับการให้บริการของนาซ่าซิตี้ ในแอปพลิเคชันนี้
        ทั้งที่มีอยู่ในปัจจุบันและที่นาซ่าซิตี้จะได้พัฒนาหรือจัดให้มีขึ้นในอนาคต
      </p>
      <p>
        1.2 ใช้บริการอาจพบเนื้อหาที่ไม่เหมาะสม หรือหยาบคาย
        อันก่อให้เกิดความไม่พอใจ ภายใต้ความเสี่ยงของ ตนเอง
      </p>
      <p>
        1.3 บริการของนาซ่าซิตี้ อาจหยุดให้บริการเป็นการชั่วคราวหรือถาวร
        หรือยกเลิกการให้บริการแก่ผู้ใช้บริการรายใดเป็นการเฉพาะ
        หากการให้บริการดังกล่าวส่งผลกระทบต่อผู้ใช้บริการอื่นๆ
        หรือขัดแย้งต่อกฎหมาย โดยไม่ต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า
      </p>
      <p>
        1.4 การหยุดหรือการยกเลิกบริการตามข้อ 1.3
        ผู้ใช้บริการจะไม่สามารถเข้าใช้บริการ
        และเข้าถึงรายละเอียดบัญชีของผู้ใช้บริการ ไฟล์เอกสารใดๆ หรือเนื้อหาอื่นๆ
        ที่อยู่ในบัญชีของผู้ใช้บริการได้
      </p>
      <p>
        1.5 ในกรณีที่บริการของนาซ่าซิตี้ หยุดให้บริการเป็นการถาวร
        หรือยกเลิกบริการแก่ผู้ใช้บริการ นาซ่าซิตี้ มีสิทธิในการลบข้อมูลต่างๆ
        ที่อยู่ในบัญชีของผู้ใช้บริการได้
        โดยไม่ต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า
      </p>
      <p>
        นาซ่าซิตี้จึงขอให้ผู้ใช้งานโปรดอ่านและทำความเข้าใจรายละเอียดในข้อตกลงและเงื่อนไขการใช้งานนี้
        โดยละเอียดก่อนกดปุ่ม “ตกลง” ยอมรับข้อตกลงและเงื่อนไขการใช้งานนี้
      </p>
      <h2>2. การใช้แอปพลิเคชันและทรัพย์สินทางปัญญา</h2>
      <p>
        2.1 ผู้ใช้งานรับทราบและตกลงจะปฏิบัติตามกฎหมาย หลักเกณฑ์ และระเบียบต่าง ๆ
        ที่เกี่ยวข้อง
        ทั้งที่มีผลใช้บังคับในปัจจุบันและที่จะมีการแก้ไขหรือเพิ่มเติมในอนาคต
        ตลอดจนข้อตกลงและเงื่อนไขการใช้งาน นโยบาย การให้บริการของนาซ่าซิตี้
        ทั้งที่กำหนดไว้เป็นการทั่วไปและที่ได้กำหนดไว้โดยเฉพาะเจาะจงในส่วนใดส่วนหนึ่งของแอปพลิเคชันนี้
        และที่ได้กำหนดไว้ในเว็บไซต์ที่ได้ฝากเว็บไซต์ไว้ที่ระบบของเรา (Web
        Hosting) (ถ้ามี) ทั้งหมด
        (ซึ่งต่อไปนี้จะเรียกรวมกันและให้ถือเป็นส่วนหนึ่งของ
        “ข้อตกลงและเงื่อนไขการใช้งาน”) ทั้งนี้
        ผู้ใช้งานรับทราบและตกลงว่าข้อตกลงและเงื่อนไขการใช้งานทั้งหมดที่กำหนดไว้นั้นอาจมีการเปลี่ยนแปลงได้เพื่อให้สอดคล้องกับแนวทางการให้บริการและหลักเกณฑ์ของกฎหมายที่มีการเปลี่ยนแปลงไป
        โดยอาจไม่ได้แจ้งหรือบอกกล่าวให้ผู้ใช้งานทราบล่วงหน้า ดังนั้น
        ผู้ใช้งานจึงควรติดตามข้อตกลงและเงื่อนไขการใช้งานเหล่านี้อยู่เสมอ
        <br />
        <br />
        อย่างไรก็ดี
        นาซ่าซิตี้อาจดำเนินการตามที่เห็นสมควรเพื่อเผยแพร่การเปลี่ยนแปลงข้อตกลงและเงื่อนไขการใช้งานภายหลังการเข้าสู่แอปพลิเคชันนี้หรือบริการของนาซ่าซิตี้
        และในกรณีที่มีการเปลี่ยนแปลงในสาระสำคัญ
        เราจะดำเนินการอย่างเต็มที่เพื่อแจ้งให้ผู้ใช้งานทราบ
        และเพื่ออำนวยความสะดวกให้แก่ท่านในฐานะผู้ใช้งานรายเดิม
        เมื่อผู้ใช้งานได้เข้าใช้งานแอปพลิเคชันนี้และ/หรือบริการของนาซ่าซิตี้ภายหลังการเปลี่ยนแปลงดังกล่าวแล้ว
        ย่อมถือว่าผู้ใช้งานตกลงยอมรับข้อตกลงและเงื่อนไขการใช้งานทั้งหมดตามที่ได้เปลี่ยนแปลงแล้ว
        <br />
        <br />
        ทั้งนี้ หากผู้ใช้งานไม่เห็นด้วยกับการดำเนินการตามวรรคก่อน
        รวมถึงรายละเอียดต่างๆ ที่ปรากฏในข้อตกลงและเงื่อนไขการใช้งานนี้
        ผู้ใช้งานสามารถยุติการใช้งานและขอให้นาซ่าซิตี้ลบข้อมูลที่เกี่ยวกับผู้ใช้งานหรือดำเนินการเพื่อใช้สิทธิอื่นใดในฐานะเจ้าของข้อมูลส่วนบุคคลได้
        ภายใต้หลักเกณฑ์ของกฎหมายและที่กำหนดในนโยบายคุ้มครองข้อมูลส่วนบุคคล
        (Privacy Policy) โดยผู้ใช้งานสามารถศึกษาข้อมูลเพิ่มเติมได้จาก Privacy
        Policy ซึ่งถือเป็นส่วนหนึ่งของข้อตกลงและเงื่อนไขการใช้งานนี้
      </p>
      <p>
        2.2 ผู้ใช้งานยอมรับและตกลงว่า
        การใช้บริการของนาซ่าซิตี้จะต้องมีการใช้บริการอินเทอร์เน็ต
        เครือข่ายโทรศัพท์มือถือ อุปกรณ์ ซอฟต์แวร์ แพลตฟอร์ม (Platform)
        และ/หรือบริการอื่นใดที่เกี่ยวข้องจากผู้ให้บริการธุรกิจดังกล่าว
        ซึ่งผู้ใช้งานจะต้องจัดหาเพื่อให้ผู้ใช้งานสามารถติดตั้ง เข้าถึง
        และใช้บริการของนาซ่าซิตี้ และ/หรือเนื้อหาได้
        ด้วยค่าใช้จ่ายของผู้ใช้งานเองทั้งสิ้น
        และการใช้บริการดังกล่าวผู้ใช้งานมีหน้าที่ต้องปฏิบัติตามข้อตกลงต่าง ๆ
        ของผู้ให้บริการดังกล่าวด้วย ดังนี้
        การเข้าถึงและใช้บริการของนาซ่าซิตี้จึงอาจมีปัจจัยอื่น ๆ
        ที่นอกเหนือการควบคุมของนาซ่าซิตี้ซึ่งมีผลกระทบต่อคุณภาพและความพร้อมใช้งานของแอปพลิเคชันและ/หรือบริการของนาซ่าซิตี้
        นาซ่าซิตี้จึงไม่สามารถการันตีคุณภาพการใช้งานได้
      </p>
      <p>
        2.3 นาซ่าซิตี้สงวนสิทธิที่จะเปลี่ยนแปลง
        หรือยกเลิกการให้บริการแอปพลิเคชันดังกล่าวไม่ว่าทั้งหมดหรือบางส่วน
        รวมถึงอาจพิจารณาเรียกเก็บค่าใช้จ่ายสำหรับการใช้แอปพลิเคชันนี้ไม่ว่ากรณีใด
        ๆ
      </p>
      <p>
        2.4 บรรดาข้อมูลที่ปรากฏในบริการของนาซ่าซิตี้ซึ่งรวมถึงแต่ไม่จำกัดเฉพาะ
        ข้อความ รูปภาพ ตารางข้อมูล กราฟ ราคาหรือมูลค่าสินค้า (ถ้ามี)
        เครื่องหมายการค้า กราฟิกต่าง ๆ เสียง การออกแบบหน้าจอแอปพลิเคชัน
        การออกแบบส่วนต่อประสานกับผู้ใช้ (Interface) ข้อมูลต่าง ๆ
        ไม่ว่าจะอยู่ในรูปแบบใด โปรแกรมซอฟต์แวร์ใด ๆ ที่มีอยู่ในแอปพลิเคชันนี้
        รวมถึงข้อมูลทั้งหลายที่ผู้ใช้งานได้ดาวน์โหลดจากแอปพลิเคชันนี้ (ถ้ามี)
        (ซึ่งต่อไปนี้จะรวมเรียกว่า “เนื้อหา”) ถือเป็นสิทธิของนาซ่าซิตี้
        หรือผู้ให้อนุญาตแก่นาซ่าซิตี้ (แล้วแต่กรณี)
        ซึ่งเนื้อหาเหล่านั้นได้รับความคุ้มครองด้านทรัพย์สินทางปัญญา
        และ/หรือสิทธิในความเป็นเจ้าของอื่น ๆ
        ตามกฎหมายของประเทศไทยและ/หรือกฎหมายของประเทศอื่นไม่ว่าในรูปแบบใด ๆ
        และไม่ว่าจะได้รับการจดทะเบียนไว้แล้วหรือไม่ก็ตาม
        <br /> <br />
        ทั้งนี้ การนำชื่อทางการค้า เครื่องหมายการค้า เครื่องหมายบริการ
        และเครื่องหมายอื่น ๆ ของนาซ่าซิตี้ รวมถึงทรัพย์สินทางปัญญาใด ๆ
        ที่ปรากฏในแอปพลิเคชันนี้ไปใช้ ไม่ว่าจะด้วยวัตถุประสงค์ใด ๆ
        ผู้ใช้งานจะต้องได้รับความยินยอมล่วงหน้าเป็นลายลักษณ์อักษรจากนาซ่าซิตี้ก่อนดำเนินการ
      </p>
      <p>
        2.5 บรรดาชื่อทางการค้า ชื่อสินค้า เครื่องหมายการค้า เครื่องหมายบริการ
        และเครื่องหมายอื่น ๆ
        รวมถึงทรัพย์สินทางปัญญาอื่นใดที่ปรากฏในแอปพลิเคชันนี้
        นอกเหนือจากสิ่งที่เป็นทรัพย์สินทางปัญญาของนาซ่าซิตี้ซึ่งได้ถูกนำมาเรียบเรียงหรือจัดให้มีขึ้นเพื่อใช้เป็นส่วนประกอบของบริการของนาซ่าซิตี้มีขึ้นเพื่อวัตถุประสงค์ในการตกแต่งรูปลักษณ์ของการใช้บริการ
        โดยนาซ่าซิตี้ในฐานะผู้ให้บริการแอปพลิเคชันไม่ได้มีเจตนาที่จะกระทำการใด ๆ
        อันเป็นการละเมิดสิทธิในทางการค้าหรือทรัพย์สินทางปัญญาของผู้ใด
      </p>
      <p>
        2.6 เว้นแต่มีข้อความระบุไว้เป็นอย่างอื่นในบริการของนาซ่าซิตี้
        บรรดาเนื้อหา ไฟล์ หรือเอกสารที่ปรากฏในแอปพลิเคชันนี้
        ผู้ใช้งานมีสิทธิเพียงเข้าดู ดาวน์โหลด อัพโหลดเนื้อหา
        และพิมพ์เนื้อหาดังกล่าว
        เฉพาะเพื่อประโยชน์แก่การใช้งานในทางส่วนตัวและต้องไม่ใช่การใช้งานที่เป็นไปเพื่อประโยชน์ในทางการค้า
        และผู้ใช้งานตกลงไม่ทำสำเนา หรือจัดเก็บ
        หรือดาวน์โหลดเนื้อหาไม่ว่าจะในรูปของเอกสารหรือในรูปแบบสื่ออิเล็กทรอนิกส์อื่นใดอันมีวัตถุประสงค์เพื่อการส่ง
        โอน จัดทำ เผยแพร่ พิมพ์ ทำซ้ำ ดัดแปลง สร้างงานที่พัฒนา นำออกแสดง
        แพร่กระจาย จำหน่าย ให้สิทธิ เช่า ให้เช่า หรือโอนเนื้อหาใด ๆ
        ให้แก่บุคคลภายนอก
        ไม่ว่าการกระทำดังกล่าวจะเป็นไปเพื่อประโยชน์ในทางการค้าหรือได้รับประโยชน์เป็นสิ่งตอบแทนอื่นใดหรือไม่ก็ตาม
        เว้นแต่จะได้รับความยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจากนาซ่าซิตี้ก่อนดำเนินการ
      </p>
      <h2>3. ข้อสงวนสิทธิ์และข้อจำกัดความรับผิด</h2>
      <p>
        3.1 บริการของนาซ่าซิตี้นี้มีขึ้นเพื่อเผยแพร่
        ให้ข้อมูลอำนวยความสะดวกในกิจกรรมงานวิ่ง
        และเป็นเครื่องมืออำนวยความสะดวกในกิจกรรมงานวิ่งเท่านั้น
        นาซ่าซิตี้มิได้ให้คำแนะนำหรือความคิดเห็นด้านกฎหมาย
        รวมทั้งไม่ได้ให้คำแนะนำเกี่ยวกับการซื้อ ขาย แลกเปลี่ยน
        หรือการทำธุรกรรมใดๆ เกี่ยวกับสินค้า สัญญาซื้อขายล่วงหน้า
        หรือผลิตภัณฑ์ทางสินค้าในรูปแบบต่างๆ ที่ปรากฏในแอปพลิเคชันนี้ นอกจากนี้
        การให้บริการของนาซ่าซิตี้ไม่ว่าในรูปแบบใดๆ
        ไม่ก่อให้เกิดความผูกพันในลักษณะที่เป็นนายหน้าหรือตัวแทนของผู้ใช้งาน
        และไม่ให้ถือว่ามีความเกี่ยวข้องกับการทำธุรกรรมใด ๆ
        ระหว่างผู้ใช้งานกับผู้ให้บริการแก่ผู้ใช้งานที่เกิดขึ้นโดยตรงหรือเป็นผลสืบเนื่องมาจากการเข้าใช้งานแอปพลิเคชันนี้และ/หรือบริการของนาซ่าซิตี้แต่อย่างใด
        <br />
        <br />
        ในการตัดสินใจใช้สินค้าหรือบริการ
        ผู้ใช้งานควรศึกษาข้อมูลเพิ่มเติมเกี่ยวกับรายละเอียดสินค้าหรือบริการ
        รายละเอียดบริษัทจำหน่ายสินค้าหรือบริการ
        รายละเอียดของสัญญาซื้อขายล่วงหน้า และผลิตภัณฑ์ในรูปแบบต่างๆ
        วิธีการซื้อขาย รวมถึงการประเมินความเสี่ยงที่สามารถยอมรับได้
        โดยผู้ใช้งานควรขอรับคำปรึกษา ความคิดเห็น
        หรือข้อมูลอื่นใดเพิ่มเติมจากบุคคลผู้ประกอบวิชาชีพที่เกี่ยวข้อง
        ตลอดจนปฏิบัติตามประกาศ ข้อบังคับ
        และกฎเกณฑ์ของหน่วยงานกำกับดูแลที่เกี่ยวข้อง
        รวมถึงข้อตกลงและเงื่อนไขการใช้งาน ตลอดจนระเบียบต่าง ๆ
        ที่เกี่ยวข้องในการเข้าใช้บริการของนาซ่าซิตี้
      </p>
      <p>
        3.2
        เนื้อหาและข้อมูลที่ได้จากการคำนวณซึ่งแสดงหรือปรากฏในแอปพลิเคชันและ/หรือบริการของนาซ่าซิตี้
        อันรวมถึงแต่ไม่จำกัดเฉพาะสินค้าหรือบริการ ที่ถูกนำเสนอตามสภาพที่ได้รับ
        (“as is” basis) โดยนาซ่าซิตี้ไม่อาจรับรองหรือรับประกันใด ๆ
        ไม่ว่าทางตรงหรือทางอ้อม ไม่ว่าจะเป็นการรับประกันด้านความครบถ้วน
        ถูกต้องเหมาะสม ความเป็นปัจจุบัน หรือความน่าเชื่อถือของเนื้อหาและข้อมูล
        หรือการรับประกันผลที่จะได้รับจากการใช้เนื้อหาหรือเข้าถึงบริการของนาซ่าซิตี้
        รวมถึงความเหมาะสมในการใช้งาน และนาซ่าซิตี้ไม่ต้องรับผิดชอบในความสูญหาย
        หรือความเสียหายใด ๆ
        รวมถึงไม่รับผิดชอบต่อผลกำไรหรือขาดทุนที่เกิดการใช้แอปพลิเคชัน
        และ/หรือจากการนำเนื้อหาข้อมูลที่ปรากฏในบริการของนาซ่าซิตี้ไปใช้ในทุกกรณี
      </p>
      <p>
        3.3
        นาซ่าซิตี้จะดำเนินการอย่างเหมาะสมเพื่อให้การเข้าถึงและการใช้งานแอปพลิเคชันนี้เป็นไปอย่างต่อเนื่อง
        ไม่หยุดชะงัก และจะจัดให้มีระบบป้องกันการเข้าถึงข้อมูลใด ๆ
        จากบุคคลที่ไม่ใช่ผู้ใช้งาน อย่างไรก็ดี
        นาซ่าซิตี้ไม่อาจรับรองได้ว่าการเข้าถึงบริการของนาซ่าซิตี้จะเป็นไปโดยปราศจากความล่าช้าและข้อผิดพลาดใด
        ๆ และไม่อาจรับรองว่าบริการของนาซ่าซิตี้จะปราศจากโปรแกรม ไฟล์
        หรือซอฟต์แวร์ที่มีจุดประสงค์มุ่งร้าย
        หรืออาจสร้างความเสียหายต่อระบบหรือข้อมูลในระบบของผู้ใช้งาน อาทิ ไวรัส
        คอมพิวเตอร์เวิร์ม โทรจันฮอร์ส สปายแวร์ หรือไฟล์ซึ่งเป็นอันตรายอื่น ๆ
        (รวมเรียกว่า “ความบกพร่อง”) ทั้งนี้
        ไม่ว่าความบกพร่องดังกล่าวจะเกิดขึ้นจากบุคคล หรือความขัดข้องทางเทคนิค
        หรือเหตุสุดวิสัยอย่างอื่น ดังนั้น
        ผู้ใช้งานจึงรับทราบเงื่อนไขดังกล่าวและตกลงว่าในกรณีที่มีความบกพร่องใด ๆ
        เกิดขึ้น นาซ่าซิตี้จะไม่รับผิดชอบในความสูญหาย ความเสียหาย ค่าสินไหมทดแทน
        ค่าใช้จ่าย หรือค่าเสียหายใด ๆ
        ที่เกิดจากหรือเป็นผลสืบเนื่องมาจากความบกพร่องเหล่านั้นในทุกกรณี
      </p>
      <p>
        3.4
        นาซ่าซิตี้สงวนสิทธิ์ในการพิจารณาไม่อนุญาตให้ผู้ใช้งานใช้งานแอปพลิเคชันนี้
        รวมถึงสงวนสิทธิ์ในการเปลี่ยนแปลง
        หรือระงับการเข้าถึงบริการของนาซ่าซิตี้ไม่ว่าบางส่วนหรือทั้งหมดและไม่ว่าในเวลาใด
        ๆ แก่ผู้ใช้งาน
        โดยไม่จำเป็นต้องบอกกล่าวล่วงหน้าหรือระบุเหตุผลในการดำเนินการนั้น
      </p>
      <p>
        3.5
        นาซ่าซิตี้ไม่อาจรับรองว่าบรรดาโฆษณาที่อยู่บนแอปพลิเคชันนี้และ/หรือบริการของนาซ่าซิตี้
        (ถ้ามี) มีความถูกต้อง สมบูรณ์ และปราศจากข้อบกพร่องใด ๆ
        โดยนาซ่าซิตี้เป็นเพียงสื่อกลางในการส่งผ่านข้อมูลการโฆษณาเท่านั้น
        และไม่ใช่ตัวแทน หุ้นส่วน หรือมีนิติสัมพันธ์ใด ๆ
        กับเจ้าของโฆษณาซึ่งปรากฏอยู่บนบริการของนาซ่าซิตี้ ตลอดจนไม่สามารถตรวจสอบ
        หรือทราบถึงแหล่งที่มาและ/หรือรายละเอียดของโฆษณาทั้งหมดที่ปรากฏในบริการของนาซ่าซิตี้ได้
        ทั้งนี้
        หากการนำเสนอโฆษณาดังกล่าวก่อให้เกิดความสูญหายหรือความเสียหายแก่ผู้ใช้งาน
        นาซ่าซิตี้จึงไม่อาจรับผิดชอบในความสูญหายหรือความเสียหายที่เกิดขึ้นแก่ผู้ใช้งานอันเนื่องมาจากการเชื่อถือหรือยินยอมปฏิบัติตามโฆษณาดังกล่าวและขอปฏิเสธความรับผิดและภาระผูกพันทางกฎหมายทุกกรณี
      </p>
      <p>
        3.6 นอกเหนือจากที่กำหนดไว้ในข้อตกลงและเงื่อนไขการใช้งานนี้ นาซ่าซิตี้
        กรรมการ ผู้จัดการ ผู้บริหาร พนักงาน ลูกจ้าง ตัวแทน
        หรือที่ปรึกษาของนาซ่าซิตี้ จะไม่รับผิดในความผิดพลาด หรือความบกพร่องใด ๆ
        จากบริการของนาซ่าซิตี้ หรือจากข้อมูล
        เนื้อหาที่ปรากฏในบริการของนาซ่าซิตี้ ตลอดจนไม่รับผิดในผลของการกระทำ
        หรือละเว้นการกระทำใด ๆ
        ที่เกี่ยวข้องกับบริการของนาซ่าซิตี้ไม่ว่าจะเกิดจากสัญญา ละเมิด ประมาท
        หรือเหตุอื่นใดที่อาจจะเกิดขึ้น
        ถึงแม้ว่านาซ่าซิตี้จะได้รับแจ้งว่าอาจจะเกิดความเสียหายดังกล่าวขึ้นก็ตาม
        ทั้งนี้ เว้นแต่
        กรณีที่ความเสียหายนั้นเกิดขึ้นจากความจงใจหรือประมาทเลินเล่ออย่างร้ายแรงของนาซ่าซิตี้
      </p>
      <h2>4. การเชื่อมโยงเว็บไซต์</h2>
      <p>
        แอปพลิเคชันนี้อาจมีการเชื่อมโยงกับฟังก์ชัน (Functions) ฟีเจอร์
        (Features) หรือเว็บไซต์อื่น ๆ รวมถึงผลิตภัณฑ์ และบริการของบุคคลภายนอก
        (“เว็บไซต์ที่เชื่อมโยง”)
        การเชื่อมโยงนี้มีขึ้นเพื่ออำนวยความสะดวกแก่ผู้ใช้งานเท่านั้น
        โดยเว็บไซต์ที่เชื่อมโยงนี้มิได้แสดงว่าได้รับการสนับสนุน
        หรืออยู่ภายใต้การควบคุม หรือความรับผิดชอบของนาซ่าซิตี้ ดังนั้น
        นาซ่าซิตี้จึงไม่อาจให้การรับรองในความถูกต้อง ความน่าเชื่อถือ
        หรือความปลอดภัยของเว็บไซต์ที่เชื่อมโยง
        และจะไม่มีความรับผิดในความสูญหายหรือเสียหายใด ๆ
        ที่ผู้ใช้งานได้รับจากการใช้งานหรือเชื่อมโยงเว็บไซต์ดังกล่าว
        และขอให้ผู้ใช้งานโปรดศึกษาข้อตกลงต่าง ๆ
        และเงื่อนไขการใช้งานของเว็บไซต์ที่เชื่อมโยงนั้น
      </p>
      <h2>5. ข้อตกลงการใช้งานเฉพาะส่วน</h2>
      <p>
        ผู้ใช้งานรับทราบและตกลงว่า นาซ่าซิตี้มีสิทธิในการลบกระทู้ หัวข้อสนทนา
        ข้อความ หรือระงับสิทธิการใช้งานกระดานสนทนา (Comments) ของผู้ใช้งาน
        (ถ้ามี) ไม่ว่าทั้งหมดหรือบางส่วน ได้ตามที่นาซ่าซิตี้พิจารณาเห็นสมควร
        โดยไม่จำเป็นต้องแจ้งหรือชี้แจงเหตุผลให้ผู้ใช้งานทราบไม่ว่ากรณีใด ๆ
      </p>
      <h2>6. นโยบายคุ้มครองข้อมูลส่วนบุคคล</h2>
      <p>
        ผู้ใช้งานรับทราบและตกลงว่า การเก็บรวบรวม ใช้
        และเปิดเผยข้อมูลส่วนบุคคลของผู้ใช้งานโดยนาซ่าซิตี้
        สำหรับการใช้งานแอปพลิเคชันนี้และ/หรือบริการของนาซ่าซิตี้
        ได้รับความคุ้มครองภายใต้นโยบายคุ้มครองข้อมูลส่วนบุคคล (Privacy Policy)
        โดยผู้ใช้งานสามารถศึกษาข้อมูลเพิ่มเติมได้จากนโยบายคุ้มครองข้อมูลส่วนบุคคล
        (Privacy Policy) ซึ่งระบุต่อจากข้อตกลงและเงื่อนไขการใช้งานนี้
      </p>
      <h2>7. นโยบายการรักษาความมั่นคงปลอดภัยของแอปพลิเคชัน</h2>
      <p>
        นาซ่าซิตี้ได้เลือกใช้เทคโนโลยี
        มาตรการรักษาความมั่นคงปลอดภัยในการทำธุรกรรมบนเครือข่ายอินเทอร์เน็ต
        เพื่อป้องกันข้อมูลของผู้ใช้งานในระหว่างการส่งข้อมูลผ่านเครือข่ายการสื่อสาร
        หรือจากการถูกโจรกรรมข้อมูลโดยบุคคลหรือเครือข่ายอื่นทุกระบบที่ไม่ได้รับอนุญาตเข้ามาเชื่อมต่อกับเครือข่ายของนาซ่าซิตี้
        เช่น Firewall และการเข้ารหัสแบบ Transport Layer Security (TLS) เป็นต้น
      </p>
      <h2>8. รหัสประจำตัว (Username) และรหัสผ่าน (Password)</h2>
      <p>
        8.1 ในกรณีที่ผู้ใช้งานได้รับรหัสประจำตัว (Username) รหัสผ่าน (Password)
        และรหัสลับ (PIN) สำหรับการทดลองใช้งานแอปพลิเคชัน (Free Trial User)
        ในการใช้งานแอปพลิเคชัน
        โดยผู้ใช้งานจะต้องเก็บรักษารหัสประจำตัวและรหัสผ่านของตนเองไว้เป็นความลับ
        การเข้าใช้งานและทำรายการใด ๆ ที่เกิดขึ้นจากการเข้าสู่ระบบ (Login)
        ด้วยรหัสประจำตัวและรหัสผ่านของผู้ใช้งานในแอปพลิเคชันนี้ให้ถือว่าการกระทำดังกล่าวถูกต้องสมบูรณ์และเป็นการกระทำของผู้ใช้งานเอง
        หากมีความเสียหายใด ๆ เกิดขึ้น ไม่ว่าจะด้วยเหตุใดก็ตาม
        ผู้ใช้งานจะต้องรับผิดชอบในการกระทำดังกล่าวทุกประการ
        และผู้ใช้งานตกลงจะไม่โต้แย้งหรือเรียกร้องให้นาซ่าซิตี้รับผิดชอบชดใช้ค่าเสียหายแทนผู้ใช้งานทุกกรณี
      </p>
      <p>
        8.2 ผู้ใช้งานรับทราบและตกลงว่า ผู้ใช้งานสามารถ เปลี่ยนแปลง ระงับ
        หรือยกเลิกรหัสประจำตัว รหัสผ่าน หรือรหัสลับของผู้ใช้งาน
        และ/หรือการใช้บริการแอปพลิเคชันนี้ได้ตลอดเวลาด้วยตนเองผ่านช่องทางต่าง ๆ
        ตามเงื่อนไขและวิธีการของแอปพลิเคชันนี้โดยผู้ใช้งานเป็นผู้กำหนด
        โดยนาซ่าซิตี้ไม่ต้องรับผิดชอบในความเสียหายใด ๆ
        ที่เกิดขึ้นก่อนกระบวนการเปลี่ยนแปลง ระงับ
        หรือยกเลิกดังกล่าวจะมีผลสมบูรณ์
      </p>
      <h2>9. การละเมิดข้อตกลงและเงื่อนไขการใช้งาน</h2>
      <p>
        ในกรณีที่มีการละเมิดข้อตกลงและเงื่อนไขการใช้งานนี้
        นาซ่าซิตี้สงวนสิทธิ์ที่จะระงับการเข้าถึงหรือยกเลิกการให้บริการใด ๆ
        ที่มีขึ้นบนแอปพลิเคชันนี้และ/หรือบริการของนาซ่าซิตี้ ทั้งนี้
        การระงับหรือยกเลิกดังกล่าวไม่ถือเป็นการตัดสิทธินาซ่าซิตี้ที่จะได้รับการเยียวยาตามข้อตกลงและเงื่อนไขการใช้งานนี้
        รวมถึงสิทธิอื่นใดตามกฎหมายที่เกี่ยวข้อง
      </p>
      <h2>10. กฎหมายที่บังคับใช้</h2>
      <p>
        ข้อตกลงและเงื่อนไขการใช้งานแอปพลิเคชันนี้อยู่ภายใต้การบังคับและตีความตามกฎหมายไทย
        และศาลไทยเป็นผู้มีอำนาจในการพิจารณาข้อพิพาทใดที่อาจเกิดขึ้น
      </p>
      <h2>11.ข้อแนะนำเกี่ยวกับการรักษาความมั่นคงปลอดภัย</h2>
      <p>
        แม้ว่า บริการของนาซ่าซิตี้
        จะมีมาตรฐานเทคโนโลยีและวิธีด้านการรักษาความปลอดภัยอย่างสูง
        เพื่อช่วยมิให้มีการเข้าสู่ข้อมูลส่วนตัวหรือข้อมูลที่เป็นความลับของผู้ใช้บริการโดยปราศจากอำนาจตามที่กล่าว
        ข้างต้นแล้วก็ตาม แต่ก็เป็นที่ทราบกันอยู่โดยทั่วไปว่า
        ปัจจุบันนี้ยังมิได้มีระบบ รักษาความปลอดภัยใดๆ
        ที่จะสามารถปกป้องข้อมูลของผู้ใช้บริการได้อย่างเด็ดขาดจากการถูกทำลายหรือถูกเข้าถึงโดยบุคคลที่ปราศจากอำนาจได้
        ดังนั้นผู้ใช้บริการจึงควรปฏิบัติตามข้อแนะนำเกี่ยวกับการรักษาความมั่นคงปลอดภัยดังต่อไปนี้ด้วยคือ
      </p>
      <p style={{ marginLeft: 20 }}>
        – ระมัดระวังในการ Download Program จาก Internet มาใช้งาน ควรตรวจสอบ
        Address ของเว็บไซต์ให้ถูกต้องก่อน Login
        เข้าใช้บริการเพื่อป้องกันกรณีที่มีการปลอมแปลงเว็บไซต์
      </p>
      <p style={{ marginLeft: 20 }}>
        – ควรติดตั้งระบบตรวจสอบไวรัสไว้ที่เครื่องและพยายามปรับปรุงให้โปรแกรม
        ตรวจสอบไวรัสในเครื่องของผู้ใช้บริการให้มีความทันสมัยอยู่เสมอ
      </p>
      <p style={{ marginLeft: 20 }}>
        – ติดตั้งโปรแกรมประเภท Personal Fire wall เพื่อป้องกันเครื่องคอมพิวเตอร์
        จากการจู่โจมของผู้ไม่ประสงค์ดี เช่น Cracker หรือ Hacker
      </p>
    </div>
  );
};

export default useragreement;
